pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                 File 'pic18_optimize_block_ordering.cpp'                  *
//                        Generated by version 2.5.0                         *
//                      august 3rd, 2013, at 23h52'14"                       *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_optimize_block_ordering.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_optimize_block_ordering.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'buildInvocationGraph'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_buildInvocationGraph (const GALGAS_ipic_31__38_BlockList constinArgument0,
                                   GALGAS_string & outArgument1,
                                   C_Compiler * inCompiler
                                   COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'performBlockOrdering'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_performBlockOrdering (const GALGAS_string constinArgument0,
                                   GALGAS_ipic_31__38_BlockList & ioArgument1,
                                   C_Compiler * inCompiler
                                   COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                    Function 'blockDiscontinuityCount'                     *
//                                                                           *
//---------------------------------------------------------------------------*

GALGAS_uint function_blockDiscontinuityCount (GALGAS_ipic_31__38_BlockList inArgument0,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                       '@blockInvocationGraph' graph                       *
//                                                                           *
//---------------------------------------------------------------------------*

GALGAS_blockInvocationGraph::GALGAS_blockInvocationGraph (void) :
AC_GALGAS_graph () {
}

//---------------------------------------------------------------------------*

GALGAS_blockInvocationGraph GALGAS_blockInvocationGraph::constructor_emptyGraph (LOCATION_ARGS) {
  GALGAS_blockInvocationGraph result ;
  result.makeNewEmptyGraph (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_blockInvocationGraph::modifier_addNode (GALGAS_lstring inKey,
                                                    GALGAS_string inArgument_0,
                                                    C_Compiler * inCompiler
                                                    COMMA_LOCATION_ARGS) {
  capCollectionElement attributes ;
  GALGAS_stringlist::makeAttributesFromObjects (attributes, inArgument_0 COMMA_THERE) ;
  const char * kErrorMessage = "the '%K' label is already declared at %L" ;
  internalAddNode (inKey, kErrorMessage, attributes, inCompiler COMMA_THERE) ;
}


//---------------------------------------------------------------------------*

void GALGAS_blockInvocationGraph::method_topologicalSort (GALGAS_stringlist & outSortedList,
                                                          GALGAS_lstringlist & outSortedKeyList,
                                                          GALGAS_stringlist & outUnsortedList,
                                                          GALGAS_lstringlist & outUnsortedKeyList,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) const {
  cSharedList * sortedList = NULL ;
  cSharedList * unsortedList = NULL ;
  internalTopologicalSort (sortedList, outSortedKeyList, unsortedList, outUnsortedKeyList, inCompiler COMMA_THERE) ;
  outSortedList = GALGAS_stringlist (sortedList) ;
  outUnsortedList = GALGAS_stringlist (unsortedList) ;
  GALGAS_stringlist::detachSharedList (sortedList) ;
  GALGAS_stringlist::detachSharedList (unsortedList) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                        @blockInvocationGraph type                         *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_blockInvocationGraph ("blockInvocationGraph",
                                             NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_blockInvocationGraph::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_blockInvocationGraph ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_blockInvocationGraph::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_blockInvocationGraph (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_blockInvocationGraph GALGAS_blockInvocationGraph::extractObject (const GALGAS_object & inObject,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_blockInvocationGraph result ;
  const GALGAS_blockInvocationGraph * p = (const GALGAS_blockInvocationGraph *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_blockInvocationGraph *> (p)) {
      result = *p ;
    }else{
      inCompiler->castError ("blockInvocationGraph", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'buildInvocationGraph'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_buildInvocationGraph (const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                   GALGAS_string & outArgument_outGraphVizString,
                                   C_Compiler * inCompiler
                                   COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outGraphVizString.drop () ; // Release 'out' argument
  outArgument_outGraphVizString = GALGAS_string ("digraph G{\n") ;
  cEnumerator_ipic_31__38_BlockList enumerator_20384 (constinArgument_inBlockList, kEnumeration_up) ;
  while (enumerator_20384.hasCurrentObject ()) {
    const enumGalgasBool test_0 = GALGAS_bool (kIsEqual, enumerator_20384.current_mBlock (HERE).mAttribute_mStartAddress.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (668)))).boolEnum () ;
    if (kBoolTrue == test_0) {
      callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_AbstractBlockTerminator *) enumerator_20384.current_mBlock (HERE).mAttribute_mTerminator.ptr (), enumerator_20384.current_mBlock (HERE).mAttribute_mLabel, outArgument_outGraphVizString, GALGAS_bool (false), inCompiler COMMA_SOURCE_FILE_AT_LINE (669)) ;
    }
    enumerator_20384.gotoNextObject () ;
  }
  outArgument_outGraphVizString.dotAssign_operation (GALGAS_string ("}\n") COMMA_SOURCE_FILE_AT_LINE (672)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'performBlockOrdering'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_performBlockOrdering (const GALGAS_string /* constinArgument_inSourceFileName */,
                                   GALGAS_ipic_31__38_BlockList & ioArgument_ioBlockList,
                                   C_Compiler * inCompiler
                                   COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_stringset var_actualRoutineSet = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (713)) ;
  var_actualRoutineSet.addAssign_operation (GALGAS_string ("main") COMMA_SOURCE_FILE_AT_LINE (714)) ;
  var_actualRoutineSet.addAssign_operation (GALGAS_string ("_high_interrupt") COMMA_SOURCE_FILE_AT_LINE (715)) ;
  var_actualRoutineSet.addAssign_operation (GALGAS_string ("_low_interrupt") COMMA_SOURCE_FILE_AT_LINE (716)) ;
  cEnumerator_ipic_31__38_BlockList enumerator_22127 (ioArgument_ioBlockList, kEnumeration_up) ;
  while (enumerator_22127.hasCurrentObject ()) {
    categoryMethod_buildCalledRoutineSet (enumerator_22127.current_mBlock (HERE), var_actualRoutineSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (718)) ;
    enumerator_22127.gotoNextObject () ;
  }
  GALGAS_symbolTableForBlockOptimization var_symbolTable = GALGAS_symbolTableForBlockOptimization::constructor_emptyMap (SOURCE_FILE_AT_LINE (721)) ;
  cEnumerator_ipic_31__38_BlockList enumerator_22337 (ioArgument_ioBlockList, kEnumeration_up) ;
  GALGAS_uint index_22331 ((PMUInt32) 0) ;
  while (enumerator_22337.hasCurrentObject ()) {
    {
    var_symbolTable.modifier_insertKey (enumerator_22337.current_mBlock (HERE).mAttribute_mLabel, index_22331, inCompiler COMMA_SOURCE_FILE_AT_LINE (723)) ;
    }
    enumerator_22337.gotoNextObject () ;
    index_22331.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (722)) ;
  }
  GALGAS_ipic_31__38_BlockList var_orderedBlockList = GALGAS_ipic_31__38_BlockList::constructor_emptyList (SOURCE_FILE_AT_LINE (726)) ;
  GALGAS_stringset var_generatedBlockSet = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (727)) ;
  cEnumerator_ipic_31__38_BlockList enumerator_22551 (ioArgument_ioBlockList, kEnumeration_up) ;
  while (enumerator_22551.hasCurrentObject ()) {
    const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, enumerator_22551.current_mBlock (HERE).mAttribute_mStartAddress.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (729)))).boolEnum () ;
    if (kBoolTrue == test_0) {
      var_orderedBlockList.addAssign_operation (enumerator_22551.current_mBlock (HERE) COMMA_SOURCE_FILE_AT_LINE (730)) ;
    }else if (kBoolFalse == test_0) {
      const enumGalgasBool test_1 = var_actualRoutineSet.reader_hasKey (enumerator_22551.current_mBlock (HERE).mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (731)).boolEnum () ;
      if (kBoolTrue == test_1) {
        GALGAS_stringset var_visitedBlockSet = GALGAS_stringset::constructor_setWithString (enumerator_22551.current_mBlock (HERE).mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (732)) ;
        GALGAS_blockInvocationGraph var_g = GALGAS_blockInvocationGraph::constructor_emptyGraph (SOURCE_FILE_AT_LINE (733)) ;
        {
        var_g.modifier_addNode (enumerator_22551.current_mBlock (HERE).mAttribute_mLabel, enumerator_22551.current_mBlock (HERE).mAttribute_mLabel.mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (734)) ;
        }
        callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_AbstractBlockTerminator *) enumerator_22551.current_mBlock (HERE).mAttribute_mTerminator.ptr (), ioArgument_ioBlockList, var_symbolTable, enumerator_22551.current_mBlock (HERE).mAttribute_mLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (739)), var_g, var_visitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (735)) ;
        GALGAS_stringlist var_orderedLabelList ;
        GALGAS_lstringlist joker_23173_3 ; // Joker input parameter
        GALGAS_stringlist joker_23173_2 ; // Joker input parameter
        GALGAS_lstringlist joker_23173_1 ; // Joker input parameter
        var_g.method_topologicalSort (var_orderedLabelList, joker_23173_3, joker_23173_2, joker_23173_1, inCompiler COMMA_SOURCE_FILE_AT_LINE (743)) ;
        cEnumerator_stringlist enumerator_23224 (var_orderedLabelList, kEnumeration_down) ;
        while (enumerator_23224.hasCurrentObject ()) {
          const enumGalgasBool test_2 = var_generatedBlockSet.reader_hasKey (enumerator_23224.current_mValue (HERE) COMMA_SOURCE_FILE_AT_LINE (748)).operator_not (SOURCE_FILE_AT_LINE (748)).boolEnum () ;
          if (kBoolTrue == test_2) {
            var_generatedBlockSet.addAssign_operation (enumerator_23224.current_mValue (HERE) COMMA_SOURCE_FILE_AT_LINE (749)) ;
            GALGAS_uint var_blockIndex ;
            var_symbolTable.method_searchKey (enumerator_23224.current_mValue (HERE).reader_nowhere (SOURCE_FILE_AT_LINE (750)), var_blockIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (750)) ;
            GALGAS_ipic_31__38_Block var_b = ioArgument_ioBlockList.reader_mBlockAtIndex (var_blockIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (751)) ;
            var_orderedBlockList.addAssign_operation (var_b COMMA_SOURCE_FILE_AT_LINE (752)) ;
          }
          enumerator_23224.gotoNextObject () ;
        }
      }
    }
    enumerator_22551.gotoNextObject () ;
  }
  ioArgument_ioBlockList = var_orderedBlockList ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                    Function 'blockDiscontinuityCount'                     *
//                                                                           *
//---------------------------------------------------------------------------*

