pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
GALGAS_uint function_blockDiscontinuityCount (GALGAS_ipic_31__38_BlockList inArgument_inBlockList,
                                              C_Compiler * inCompiler
                                              COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outResult ; // Returned variable
  result_outResult = GALGAS_uint ((PMUInt32) 0U) ;
  cEnumerator_ipic_31__38_BlockList enumerator_23901 (inArgument_inBlockList, kEnumeration_up) ;
  GALGAS_uint index_23895 ((PMUInt32) 0) ;
  while (enumerator_23901.hasCurrentObject ()) {
    const enumGalgasBool test_0 = GALGAS_bool (kIsEqual, enumerator_23901.current_mBlock (HERE).mAttribute_mStartAddress.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (769)))).boolEnum () ;
    if (kBoolTrue == test_0) {
      GALGAS_string var_nextBlockLabel ;
      const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, index_23895.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (771)).objectCompare (inArgument_inBlockList.reader_length (SOURCE_FILE_AT_LINE (771)))).boolEnum () ;
      if (kBoolTrue == test_1) {
        var_nextBlockLabel = inArgument_inBlockList.reader_mBlockAtIndex (index_23895.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (772)), inCompiler COMMA_SOURCE_FILE_AT_LINE (772)).mAttribute_mLabel.mAttribute_string ;
      }else if (kBoolFalse == test_1) {
        var_nextBlockLabel = GALGAS_string::makeEmptyString () ;
      }
      const enumGalgasBool test_2 = callCategoryReader_needToInsertJumpInstruction ((const cPtr_ipic_31__38_AbstractBlockTerminator *) enumerator_23901.current_mBlock (HERE).mAttribute_mTerminator.ptr (), var_nextBlockLabel, inCompiler COMMA_SOURCE_FILE_AT_LINE (776)).boolEnum () ;
      if (kBoolTrue == test_2) {
        result_outResult = result_outResult.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (777)) ;
      }
    }
    enumerator_23901.gotoNextObject () ;
    index_23895.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (768)) ;
  }
//---
  return result_outResult ;
}


//---------------------------------------------------------------------------*
//  Function introspection                                                   *
//---------------------------------------------------------------------------*

static const C_galgas_type_descriptor * functionArgs_blockDiscontinuityCount [2] = {
  & kTypeDescriptor_GALGAS_ipic_31__38_BlockList,
  NULL
} ;

//---------------------------------------------------------------------------*

static GALGAS_object functionWithGenericHeader_blockDiscontinuityCount (C_Compiler * inCompiler,
                                                                        const cObjectArray & inEffectiveParameterArray,
                                                                        const GALGAS_location & /* §§ inErrorLocation */
                                                                        COMMA_LOCATION_ARGS) {
  const GALGAS_ipic_31__38_BlockList operand0 = GALGAS_ipic_31__38_BlockList::extractObject (inEffectiveParameterArray.objectAtIndex (0 COMMA_HERE),
                                                                                             inCompiler
                                                                                             COMMA_THERE) ;
  return function_blockDiscontinuityCount (operand0,
                                           inCompiler
                                           COMMA_THERE).reader_object (THERE) ;
}

//---------------------------------------------------------------------------*

C_galgas_function_descriptor functionDescriptor_blockDiscontinuityCount ("blockDiscontinuityCount",
                                                                         functionWithGenericHeader_blockDiscontinuityCount,
                                                                         & kTypeDescriptor_GALGAS_uint,
                                                                         1,
                                                                         functionArgs_blockDiscontinuityCount) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'ipic18OptimizeBlockOrdering'                   *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_ipic_31__38_OptimizeBlockOrdering (const GALGAS_string constinArgument_inSourceFileName,
                                                GALGAS_string & ioArgument_ioListFileContents,
                                                GALGAS_ipic_31__38_BlockList & ioArgument_ioGeneratedBlockList,
                                                C_Compiler * inCompiler
                                                COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (790)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (790)) COMMA_SOURCE_FILE_AT_LINE (790)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*").operator_concat (GALGAS_string ("BLOCK REPRESENTATION ORDERING OPTIMIZATION").reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 77U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (791)) COMMA_SOURCE_FILE_AT_LINE (791)).operator_concat (GALGAS_string ("*\n") COMMA_SOURCE_FILE_AT_LINE (791)) COMMA_SOURCE_FILE_AT_LINE (791)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (792)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (792)) COMMA_SOURCE_FILE_AT_LINE (792)) ;
  inCompiler->printMessage (GALGAS_string ("Block ordering optimization:\n") COMMA_SOURCE_FILE_AT_LINE (794)) ;
  inCompiler->printMessage (GALGAS_string ("  discontinuity count before optimization: ").operator_concat (function_blockDiscontinuityCount (ioArgument_ioGeneratedBlockList, inCompiler COMMA_SOURCE_FILE_AT_LINE (795)).reader_string (SOURCE_FILE_AT_LINE (795)) COMMA_SOURCE_FILE_AT_LINE (795)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (795)) COMMA_SOURCE_FILE_AT_LINE (795)) ;
  GALGAS_string var_invocationGraph ;
  {
  routine_buildInvocationGraph (ioArgument_ioGeneratedBlockList, var_invocationGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (797)) ;
  }
  GALGAS_bool joker_25226_0 ; // Joker input parameter
  var_invocationGraph.method_writeToFileWhenDifferentContents (constinArgument_inSourceFileName.operator_concat (GALGAS_string (".blockInvocation.dot") COMMA_SOURCE_FILE_AT_LINE (798)), joker_25226_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (798)) ;
  {
  routine_performBlockOrdering (constinArgument_inSourceFileName, ioArgument_ioGeneratedBlockList, inCompiler COMMA_SOURCE_FILE_AT_LINE (803)) ;
  }
  inCompiler->printMessage (GALGAS_string ("  discontinuity count after optimization: ").operator_concat (function_blockDiscontinuityCount (ioArgument_ioGeneratedBlockList, inCompiler COMMA_SOURCE_FILE_AT_LINE (804)).reader_string (SOURCE_FILE_AT_LINE (804)) COMMA_SOURCE_FILE_AT_LINE (804)).operator_concat (GALGAS_string ("\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (804)) COMMA_SOURCE_FILE_AT_LINE (804)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedGotoTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedGotoTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                  GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                                  GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                                  const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                                  const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                                  const GALGAS_lstring /* constinArgument_inLabelBlock */,
                                                                                  C_Compiler * /* inCompiler */
                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_ComputedGotoTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_ComputedGotoTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

