pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
C_PrologueEpilogue gMethod_ipic_31__38_ComputedGotoTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedRETLWTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedRETLWTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                   GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                                   GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                                   const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                                   const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                                   const GALGAS_lstring /* constinArgument_inLabelBlock */,
                                                                                   C_Compiler * /* inCompiler */
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_ComputedRETLWTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_ComputedRETLWTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedRETLWTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedBraTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedBraTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                 GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                                 GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                                 const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                                 const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                                 const GALGAS_lstring /* constinArgument_inLabelBlock */,
                                                                                 C_Compiler * /* inCompiler */
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedBraTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_ComputedBraTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_ComputedBraTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedBraTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_ComputedBraTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks> gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildOrderedBlocks (const PMSInt32 inClassIndex,
                                             categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks inMethod) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks (void) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks (NULL,
                                                                                   freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                            GALGAS_blockInvocationGraph & io_ioGraph,
                                            GALGAS_stringset & io_ioVisitedBlockSet,
                                            const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                            const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                            const GALGAS_lstring constin_inLabelBlock,
                                            C_Compiler * inCompiler
                                            COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_AbstractBlockTerminator) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks.count ()) {
      f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks.count ()) {
           f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioGraph, io_ioVisitedBlockSet, constin_inBlockList, constin_inSymbolTable, constin_inLabelBlock, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@ipic18ReturnTerminator buildOrderedBlocks'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ReturnTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                            GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                            GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                            const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                            const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                            const GALGAS_lstring /* constinArgument_inLabelBlock */,
                                                                            C_Compiler * /* inCompiler */
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ReturnTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_ReturnTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_ReturnTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

