pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
C_PrologueEpilogue gMethod_ipic_31__38_ReturnTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_ReturnTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@ipic18RetlwTerminator buildOrderedBlocks'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetlwTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                           GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                           GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                           const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                           const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                           const GALGAS_lstring /* constinArgument_inLabelBlock */,
                                                                           C_Compiler * /* inCompiler */
                                                                           COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_RetlwTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_RetlwTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_RetlwTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetlwTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_RetlwTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@ipic18RetfieTerminator buildOrderedBlocks'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetfieTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                            GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                            GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                            const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                            const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                            const GALGAS_lstring /* constinArgument_inLabelBlock */,
                                                                            C_Compiler * /* inCompiler */
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_RetfieTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_RetfieTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_RetfieTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetfieTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_RetfieTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@ipic18JumpTerminator buildOrderedBlocks'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_JumpTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                          GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                          GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                          const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                          const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                          const GALGAS_lstring constinArgument_inLabelBlock,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_JumpTerminator * object = (const cPtr_ipic_31__38_JumpTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_JumpTerminator) ;
  const enumGalgasBool test_0 = ioArgument_ioVisitedBlockSet.reader_hasKey (object->mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (104)).operator_not (SOURCE_FILE_AT_LINE (104)).boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    ioArgument_ioGraph.modifier_addArc (constinArgument_inLabelBlock, object->mAttribute_mLabel COMMA_SOURCE_FILE_AT_LINE (105)) ;
    }
    ioArgument_ioVisitedBlockSet.addAssign_operation (object->mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (106)) ;
    GALGAS_uint var_targetBlockIndex ;
    constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mLabel, var_targetBlockIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (107)) ;
    GALGAS_ipic_31__38_Block var_targetBlock = constinArgument_inBlockList.reader_mBlockAtIndex (var_targetBlockIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (108)) ;
    {
    ioArgument_ioGraph.modifier_addNode (var_targetBlock.mAttribute_mLabel, var_targetBlock.mAttribute_mLabel.mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (109)) ;
    }
    callCategoryMethod_buildOrderedBlocks ((const cPtr_ipic_31__38_AbstractBlockTerminator *) var_targetBlock.mAttribute_mTerminator.ptr (), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, constinArgument_inBlockList, constinArgument_inSymbolTable, var_targetBlock.mAttribute_mLabel, inCompiler COMMA_SOURCE_FILE_AT_LINE (110)) ;
  }
}
//---------------------------------------------------------------------------*

