pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
static void defineCategoryMethod_ipic_31__38_JumpTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_JumpTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_JumpTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_JumpTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_JumpTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18AbstractConditionTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                       GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                       GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                       const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                       const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                       const GALGAS_lstring constinArgument_inLabelBlock,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_AbstractConditionTerminator * object = (const cPtr_ipic_31__38_AbstractConditionTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_AbstractConditionTerminator) ;
  callCategoryMethod_buildOrderedBlocks ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inLabelBlock, inCompiler COMMA_SOURCE_FILE_AT_LINE (129)) ;
  callCategoryMethod_buildOrderedBlocks ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inLabelBlock, inCompiler COMMA_SOURCE_FILE_AT_LINE (136)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_ipic_31__38_AbstractConditionTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractConditionTerminator_buildOrderedBlocks (defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18RegisterComparisonTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                       GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                       GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                       const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                       const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                       const GALGAS_lstring constinArgument_inLabelBlock,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_RegisterComparisonTerminator * object = (const cPtr_pic_31__38_RegisterComparisonTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_RegisterComparisonTerminator) ;
  callCategoryMethod_buildOrderedBlocks ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inLabelBlock, inCompiler COMMA_SOURCE_FILE_AT_LINE (154)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_pic_31__38_RegisterComparisonTerminator.mSlotID,
                                          categoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

