pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
C_PrologueEpilogue gMethod_pic_31__38_RegisterComparisonTerminator_buildOrderedBlocks (defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18TestRegisterTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_TestRegisterTerminator_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                 GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                 GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                 const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                 const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                 const GALGAS_lstring constinArgument_inLabelBlock,
                                                                                 C_Compiler * inCompiler
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_TestRegisterTerminator * object = (const cPtr_pic_31__38_TestRegisterTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_TestRegisterTerminator) ;
  callCategoryMethod_buildOrderedBlocks ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inLabelBlock, inCompiler COMMA_SOURCE_FILE_AT_LINE (172)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_TestRegisterTerminator_buildOrderedBlocks (void) {
  enterCategoryMethod_buildOrderedBlocks (kTypeDescriptor_GALGAS_pic_31__38_TestRegisterTerminator.mSlotID,
                                          categoryMethod_pic_31__38_TestRegisterTerminator_buildOrderedBlocks) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_TestRegisterTerminator_buildOrderedBlocks (defineCategoryMethod_pic_31__38_TestRegisterTerminator_buildOrderedBlocks, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph> gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildInvocationGraph (const PMSInt32 inClassIndex,
                                               categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph inMethod) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph (void) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph (NULL,
                                                                                     freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                              const GALGAS_lstring constin_inBlockLabel,
                                              GALGAS_string & io_ioGraphVizString,
                                              const GALGAS_bool constin_inDottedArrow,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_AbstractBlockTerminator) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph.count ()) {
      f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph.count ()) {
           f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inBlockLabel, io_ioGraphVizString, constin_inDottedArrow, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@ipic18ReturnTerminator buildInvocationGraph' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ReturnTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                              const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                              GALGAS_string & /* ioArgument_ioGraphVizString */,
                                                                              const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                              C_Compiler * /* inCompiler */
                                                                              COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ReturnTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_ReturnTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_ReturnTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ReturnTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_ReturnTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@ipic18RetlwTerminator buildInvocationGraph'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetlwTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                             const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                             GALGAS_string & /* ioArgument_ioGraphVizString */,
                                                                             const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                             C_Compiler * /* inCompiler */
                                                                             COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_RetlwTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_RetlwTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_RetlwTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetlwTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_RetlwTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@ipic18RetfieTerminator buildInvocationGraph' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetfieTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                              const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                              GALGAS_string & /* ioArgument_ioGraphVizString */,
                                                                              const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                              C_Compiler * /* inCompiler */
                                                                              COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

