pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
static void defineCategoryMethod_ipic_31__38_RetfieTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_RetfieTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_RetfieTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetfieTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_RetfieTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedGotoTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedGotoTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                    const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                                    GALGAS_string & /* ioArgument_ioGraphVizString */,
                                                                                    const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                                    C_Compiler * /* inCompiler */
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_ComputedGotoTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_ComputedGotoTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedGotoTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedRETLWTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedRETLWTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                     const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                                     GALGAS_string & /* ioArgument_ioGraphVizString */,
                                                                                     const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                                     C_Compiler * /* inCompiler */
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_ComputedRETLWTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_ComputedRETLWTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedRETLWTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedBraTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedBraTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                   const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                                   GALGAS_string & /* ioArgument_ioGraphVizString */,
                                                                                   const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                                   C_Compiler * /* inCompiler */
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedBraTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_ComputedBraTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_ComputedBraTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedBraTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_ComputedBraTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18AbstractConditionTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

