pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
static void categoryMethod_ipic_31__38_AbstractConditionTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                         const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                         GALGAS_string & ioArgument_ioGraphVizString,
                                                                                         const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_AbstractConditionTerminator * object = (const cPtr_ipic_31__38_AbstractConditionTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_AbstractConditionTerminator) ;
  callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inBlockLabel, ioArgument_ioGraphVizString, GALGAS_bool (false), inCompiler COMMA_SOURCE_FILE_AT_LINE (254)) ;
  callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockLabel, ioArgument_ioGraphVizString, GALGAS_bool (false), inCompiler COMMA_SOURCE_FILE_AT_LINE (255)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_AbstractConditionTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_AbstractConditionTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractConditionTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18RegisterComparisonTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_RegisterComparisonTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                         const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                         GALGAS_string & ioArgument_ioGraphVizString,
                                                                                         const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_RegisterComparisonTerminator * object = (const cPtr_pic_31__38_RegisterComparisonTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_RegisterComparisonTerminator) ;
  callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inBlockLabel, ioArgument_ioGraphVizString, GALGAS_bool (false), inCompiler COMMA_SOURCE_FILE_AT_LINE (265)) ;
  callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockLabel, ioArgument_ioGraphVizString, GALGAS_bool (true), inCompiler COMMA_SOURCE_FILE_AT_LINE (266)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_pic_31__38_RegisterComparisonTerminator.mSlotID,
                                            categoryMethod_pic_31__38_RegisterComparisonTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_RegisterComparisonTerminator_buildInvocationGraph (defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18TestRegisterTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_TestRegisterTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                   const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                   GALGAS_string & ioArgument_ioGraphVizString,
                                                                                   const GALGAS_bool /* constinArgument_inDottedArrow */,
                                                                                   C_Compiler * inCompiler
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_TestRegisterTerminator * object = (const cPtr_pic_31__38_TestRegisterTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_TestRegisterTerminator) ;
  callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inBlockLabel, ioArgument_ioGraphVizString, GALGAS_bool (false), inCompiler COMMA_SOURCE_FILE_AT_LINE (276)) ;
  callCategoryMethod_buildInvocationGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockLabel, ioArgument_ioGraphVizString, GALGAS_bool (true), inCompiler COMMA_SOURCE_FILE_AT_LINE (277)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_TestRegisterTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_pic_31__38_TestRegisterTerminator.mSlotID,
                                            categoryMethod_pic_31__38_TestRegisterTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

