pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
C_PrologueEpilogue gMethod_pic_31__38_TestRegisterTerminator_buildInvocationGraph (defineCategoryMethod_pic_31__38_TestRegisterTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@ipic18JumpTerminator buildInvocationGraph'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_JumpTerminator_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                            const GALGAS_lstring constinArgument_inBlockLabel,
                                                                            GALGAS_string & ioArgument_ioGraphVizString,
                                                                            const GALGAS_bool constinArgument_inDottedArrow,
                                                                            C_Compiler * /* inCompiler */
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_JumpTerminator * object = (const cPtr_ipic_31__38_JumpTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_JumpTerminator) ;
  ioArgument_ioGraphVizString.dotAssign_operation (GALGAS_string ("  \"").operator_concat (constinArgument_inBlockLabel.reader_string (SOURCE_FILE_AT_LINE (287)) COMMA_SOURCE_FILE_AT_LINE (287)).operator_concat (GALGAS_string ("\" -> \"") COMMA_SOURCE_FILE_AT_LINE (287)).operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (287)) COMMA_SOURCE_FILE_AT_LINE (287)).operator_concat (GALGAS_string ("\"") COMMA_SOURCE_FILE_AT_LINE (287)) COMMA_SOURCE_FILE_AT_LINE (287)) ;
  const enumGalgasBool test_0 = constinArgument_inDottedArrow.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioGraphVizString.dotAssign_operation (GALGAS_string (" [style=dotted]") COMMA_SOURCE_FILE_AT_LINE (289)) ;
  }
  ioArgument_ioGraphVizString.dotAssign_operation (GALGAS_string (" ;\n") COMMA_SOURCE_FILE_AT_LINE (291)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_JumpTerminator_buildInvocationGraph (void) {
  enterCategoryMethod_buildInvocationGraph (kTypeDescriptor_GALGAS_ipic_31__38_JumpTerminator.mSlotID,
                                            categoryMethod_ipic_31__38_JumpTerminator_buildInvocationGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_JumpTerminator_buildInvocationGraph (defineCategoryMethod_ipic_31__38_JumpTerminator_buildInvocationGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18AbstractBlockTerminator buildOrderingConstraintGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph> gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildOrderingConstraintGraph (const PMSInt32 inClassIndex,
                                                       categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph inMethod) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                      const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                                      const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                                      const GALGAS_lstring constin_inBlockLabel,
                                                      const GALGAS_lstring constin_inDominatorLabel,
                                                      GALGAS_blockInvocationGraph & io_ioGraph,
                                                      GALGAS_stringset & io_ioVisitedBlockSet,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_AbstractBlockTerminator) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph.count ()) {
      f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph.count ()) {
           f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inBlockList, constin_inSymbolTable, constin_inBlockLabel, constin_inDominatorLabel, io_ioGraph, io_ioVisitedBlockSet, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                             const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                                             const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                                             const GALGAS_lstring /* constinArgument_inBlockLabel */,
                                                                                             const GALGAS_lstring /* constinArgument_inDominatorLabel */,
                                                                                             GALGAS_blockInvocationGraph & /* ioArgument_ioGraph */,
                                                                                             GALGAS_stringset & /* ioArgument_ioVisitedBlockSet */,
                                                                                             C_Compiler * /* inCompiler */
                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph (void) {
  enterCategoryMethod_buildOrderingConstraintGraph (kTypeDescriptor_GALGAS_ipic_31__38_AbstractBlockTerminator.mSlotID,
                                                    categoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph (void) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph.free () ;
}

//---------------------------------------------------------------------------*

