pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
C_PrologueEpilogue gMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph (defineCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph,
                                                                                             freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18JumpTerminator buildOrderingConstraintGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_JumpTerminator_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                    const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                    const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                    const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                    const GALGAS_lstring constinArgument_inDominatorLabel,
                                                                                    GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                    GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                    C_Compiler * inCompiler
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_JumpTerminator * object = (const cPtr_ipic_31__38_JumpTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_JumpTerminator) ;
  const enumGalgasBool test_0 = ioArgument_ioVisitedBlockSet.reader_hasKey (object->mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (320)).operator_not (SOURCE_FILE_AT_LINE (320)).boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    ioArgument_ioGraph.modifier_addArc (constinArgument_inBlockLabel, object->mAttribute_mLabel COMMA_SOURCE_FILE_AT_LINE (321)) ;
    }
    const enumGalgasBool test_1 = GALGAS_bool (kIsNotEqual, constinArgument_inDominatorLabel.mAttribute_string.objectCompare (GALGAS_string::makeEmptyString ())).boolEnum () ;
    if (kBoolTrue == test_1) {
      {
      ioArgument_ioGraph.modifier_addArc (constinArgument_inDominatorLabel, object->mAttribute_mLabel COMMA_SOURCE_FILE_AT_LINE (323)) ;
      }
    }
    {
    ioArgument_ioGraph.modifier_addNode (object->mAttribute_mLabel, object->mAttribute_mLabel.mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (326)) ;
    }
    ioArgument_ioVisitedBlockSet.addAssign_operation (object->mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (327)) ;
    GALGAS_uint var_blockIndex ;
    constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mLabel, var_blockIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (328)) ;
    GALGAS_ipic_31__38_Block var_nextBlock = constinArgument_inBlockList.reader_mBlockAtIndex (var_blockIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (329)) ;
    callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_AbstractBlockTerminator *) var_nextBlock.mAttribute_mTerminator.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, object->mAttribute_mLabel, constinArgument_inDominatorLabel, ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (330)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_JumpTerminator_buildOrderingConstraintGraph (void) {
  enterCategoryMethod_buildOrderingConstraintGraph (kTypeDescriptor_GALGAS_ipic_31__38_JumpTerminator.mSlotID,
                                                    categoryMethod_ipic_31__38_JumpTerminator_buildOrderingConstraintGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_JumpTerminator_buildOrderingConstraintGraph (defineCategoryMethod_ipic_31__38_JumpTerminator_buildOrderingConstraintGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18AbstractConditionTerminator buildOrderingConstraintGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                 const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                                 const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                                 const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                                 const GALGAS_lstring /* constinArgument_inDominatorLabel */,
                                                                                                 GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                                 GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_AbstractConditionTerminator * object = (const cPtr_ipic_31__38_AbstractConditionTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_AbstractConditionTerminator) ;
  callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (355)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (351)) ;
  callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (363)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (359)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderingConstraintGraph (void) {
  enterCategoryMethod_buildOrderingConstraintGraph (kTypeDescriptor_GALGAS_ipic_31__38_AbstractConditionTerminator.mSlotID,
                                                    categoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderingConstraintGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractConditionTerminator_buildOrderingConstraintGraph (defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_buildOrderingConstraintGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18RegisterComparisonTerminator buildOrderingConstraintGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

