pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
static void categoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                 const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                                 const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                                 const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                                 const GALGAS_lstring /* constinArgument_inDominatorLabel */,
                                                                                                 GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                                 GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_RegisterComparisonTerminator * object = (const cPtr_pic_31__38_RegisterComparisonTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_RegisterComparisonTerminator) ;
  callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (384)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (380)) ;
  const enumGalgasBool test_0 = GALGAS_bool (NULL != dynamic_cast <const cPtr_ipic_31__38_JumpTerminator *> (object->mAttribute_mInstructionIfConditionTrue.ptr ())).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_ipic_31__38_JumpTerminator temp_1 ;
    if (object->mAttribute_mInstructionIfConditionTrue.isValid ()) {
      if (NULL != dynamic_cast <const cPtr_ipic_31__38_JumpTerminator *> (object->mAttribute_mInstructionIfConditionTrue.ptr ())) {
        temp_1 = (cPtr_ipic_31__38_JumpTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr () ;
      }else{
        inCompiler->castError ("ipic_31__38_JumpTerminator", object->mAttribute_mInstructionIfConditionTrue.ptr ()->classDescriptor () COMMA_SOURCE_FILE_AT_LINE (390)) ;
      }
    }
    GALGAS_ipic_31__38_JumpTerminator var_jp = temp_1 ;
    callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, var_jp.reader_mLabel (SOURCE_FILE_AT_LINE (395)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (391)) ;
  }else if (kBoolFalse == test_0) {
    callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (404)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (400)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderingConstraintGraph (void) {
  enterCategoryMethod_buildOrderingConstraintGraph (kTypeDescriptor_GALGAS_pic_31__38_RegisterComparisonTerminator.mSlotID,
                                                    categoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderingConstraintGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_RegisterComparisonTerminator_buildOrderingConstraintGraph (defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_buildOrderingConstraintGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18TestRegisterTerminator buildOrderingConstraintGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_TestRegisterTerminator_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                           const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                           const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                           const GALGAS_lstring constinArgument_inBlockLabel,
                                                                                           const GALGAS_lstring /* constinArgument_inDominatorLabel */,
                                                                                           GALGAS_blockInvocationGraph & ioArgument_ioGraph,
                                                                                           GALGAS_stringset & ioArgument_ioVisitedBlockSet,
                                                                                           C_Compiler * inCompiler
                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_TestRegisterTerminator * object = (const cPtr_pic_31__38_TestRegisterTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_TestRegisterTerminator) ;
  callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (426)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (422)) ;
  const enumGalgasBool test_0 = GALGAS_bool (NULL != dynamic_cast <const cPtr_ipic_31__38_JumpTerminator *> (object->mAttribute_mInstructionIfConditionTrue.ptr ())).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_ipic_31__38_JumpTerminator temp_1 ;
    if (object->mAttribute_mInstructionIfConditionTrue.isValid ()) {
      if (NULL != dynamic_cast <const cPtr_ipic_31__38_JumpTerminator *> (object->mAttribute_mInstructionIfConditionTrue.ptr ())) {
        temp_1 = (cPtr_ipic_31__38_JumpTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr () ;
      }else{
        inCompiler->castError ("ipic_31__38_JumpTerminator", object->mAttribute_mInstructionIfConditionTrue.ptr ()->classDescriptor () COMMA_SOURCE_FILE_AT_LINE (432)) ;
      }
    }
    GALGAS_ipic_31__38_JumpTerminator var_jp = temp_1 ;
    callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, var_jp.reader_mLabel (SOURCE_FILE_AT_LINE (437)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (433)) ;
  }else if (kBoolFalse == test_0) {
    callCategoryMethod_buildOrderingConstraintGraph ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inBlockList, constinArgument_inSymbolTable, constinArgument_inBlockLabel, GALGAS_string::makeEmptyString ().reader_nowhere (SOURCE_FILE_AT_LINE (446)), ioArgument_ioGraph, ioArgument_ioVisitedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (442)) ;
  }
}
//---------------------------------------------------------------------------*

