pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
C_PrologueEpilogue gReader_pic_31__38_RegisterComparisonTerminator_needToInsertJumpInstruction (defineCategoryReader_pic_31__38_RegisterComparisonTerminator_needToInsertJumpInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18TestRegisterTerminator needToInsertJumpInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38_TestRegisterTerminator_needToInsertJumpInstruction (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                 const GALGAS_string & constinArgument_inNextBlockLabel,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outResult ; // Returned variable
  const cPtr_pic_31__38_TestRegisterTerminator * object = (const cPtr_pic_31__38_TestRegisterTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_TestRegisterTerminator) ;
  result_outResult = callCategoryReader_needToInsertJumpInstruction ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inNextBlockLabel, inCompiler COMMA_SOURCE_FILE_AT_LINE (571)) ;
//---
  return result_outResult ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38_TestRegisterTerminator_needToInsertJumpInstruction (void) {
  enterCategoryReader_needToInsertJumpInstruction (kTypeDescriptor_GALGAS_pic_31__38_TestRegisterTerminator.mSlotID,
                                                   categoryReader_pic_31__38_TestRegisterTerminator_needToInsertJumpInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38_TestRegisterTerminator_needToInsertJumpInstruction (defineCategoryReader_pic_31__38_TestRegisterTerminator_needToInsertJumpInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18AbstractBlockTerminator buildTerminatorCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet> gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildTerminatorCalledRoutineSet (const PMSInt32 inClassIndex,
                                                          categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet inMethod) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_buildTerminatorCalledRoutineSet (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                         GALGAS_stringset & io_ioReferencedBlockSet,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_AbstractBlockTerminator) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet.count ()) {
      f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet.count ()) {
           f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioReferencedBlockSet, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                                GALGAS_stringset & /* ioArgument_ioReferencedBlockSet */,
                                                                                                C_Compiler * /* inCompiler */
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet (void) {
  enterCategoryMethod_buildTerminatorCalledRoutineSet (kTypeDescriptor_GALGAS_ipic_31__38_AbstractBlockTerminator.mSlotID,
                                                       categoryMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet (void) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet (defineCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet,
                                                                                                freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedGotoTerminator buildTerminatorCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

