pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
static void categoryMethod_ipic_31__38_ComputedGotoTerminator_buildTerminatorCalledRoutineSet (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                               GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                                                               C_Compiler * /* inCompiler */
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ComputedGotoTerminator * object = (const cPtr_ipic_31__38_ComputedGotoTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ComputedGotoTerminator) ;
  cEnumerator_lstringlist enumerator_18011 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_18011.hasCurrentObject ()) {
    ioArgument_ioReferencedBlockSet.addAssign_operation (enumerator_18011.current_mValue (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (592)) ;
    enumerator_18011.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_buildTerminatorCalledRoutineSet (void) {
  enterCategoryMethod_buildTerminatorCalledRoutineSet (kTypeDescriptor_GALGAS_ipic_31__38_ComputedGotoTerminator.mSlotID,
                                                       categoryMethod_ipic_31__38_ComputedGotoTerminator_buildTerminatorCalledRoutineSet) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedGotoTerminator_buildTerminatorCalledRoutineSet (defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_buildTerminatorCalledRoutineSet, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstruction buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet> gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildInstructionCalledRoutineSet (const PMSInt32 inClassIndex,
                                                           categoryMethodSignature_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet inMethod) {
  gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_buildInstructionCalledRoutineSet (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                          GALGAS_stringset & io_ioReferencedBlockSet,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_SequentialInstruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet.count ()) {
      f = gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet.count ()) {
           f = gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioReferencedBlockSet, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet (const cPtr_ipic_31__38_SequentialInstruction * /* inObject */,
                                                                                               GALGAS_stringset & /* ioArgument_ioReferencedBlockSet */,
                                                                                               C_Compiler * /* inCompiler */
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet (void) {
  enterCategoryMethod_buildInstructionCalledRoutineSet (kTypeDescriptor_GALGAS_ipic_31__38_SequentialInstruction.mSlotID,
                                                        categoryMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet (void) {
  gCategoryMethodTable_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet (defineCategoryMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet,
                                                                                               freeCategoryMethod_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18_intermediate_JSR buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

