pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.cpp
static void categoryMethod_ipic_31__38__5F_intermediate_5F_JSR_buildInstructionCalledRoutineSet (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                                                                 GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                                                                 C_Compiler * /* inCompiler */
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_ipic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38__5F_intermediate_5F_JSR) ;
  ioArgument_ioReferencedBlockSet.addAssign_operation (object->mAttribute_mTargetLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (612)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38__5F_intermediate_5F_JSR_buildInstructionCalledRoutineSet (void) {
  enterCategoryMethod_buildInstructionCalledRoutineSet (kTypeDescriptor_GALGAS_ipic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                                        categoryMethod_ipic_31__38__5F_intermediate_5F_JSR_buildInstructionCalledRoutineSet) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38__5F_intermediate_5F_JSR_buildInstructionCalledRoutineSet (defineCategoryMethod_ipic_31__38__5F_intermediate_5F_JSR_buildInstructionCalledRoutineSet, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18_intermediate_instruction_computed_rcall buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildInstructionCalledRoutineSet (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                                                                                              GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                                                                                              C_Compiler * /* inCompiler */
                                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  cEnumerator_lstringlist enumerator_18925 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_18925.hasCurrentObject ()) {
    ioArgument_ioReferencedBlockSet.addAssign_operation (enumerator_18925.current_mValue (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (621)) ;
    enumerator_18925.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildInstructionCalledRoutineSet (void) {
  enterCategoryMethod_buildInstructionCalledRoutineSet (kTypeDescriptor_GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                                        categoryMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildInstructionCalledRoutineSet) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildInstructionCalledRoutineSet (defineCategoryMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildInstructionCalledRoutineSet, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18_skip_instruction buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38__5F_skip_5F_instruction_buildInstructionCalledRoutineSet (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                                                                 GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38__5F_skip_5F_instruction * object = (const cPtr_ipic_31__38__5F_skip_5F_instruction *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38__5F_skip_5F_instruction) ;
  callCategoryMethod_buildInstructionCalledRoutineSet ((const cPtr_ipic_31__38_SequentialInstruction *) object->mAttribute_mEmbeddedInstruction.ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (630)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38__5F_skip_5F_instruction_buildInstructionCalledRoutineSet (void) {
  enterCategoryMethod_buildInstructionCalledRoutineSet (kTypeDescriptor_GALGAS_ipic_31__38__5F_skip_5F_instruction.mSlotID,
                                                        categoryMethod_ipic_31__38__5F_skip_5F_instruction_buildInstructionCalledRoutineSet) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38__5F_skip_5F_instruction_buildInstructionCalledRoutineSet (defineCategoryMethod_ipic_31__38__5F_skip_5F_instruction_buildInstructionCalledRoutineSet, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstructionList buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_buildInstructionCalledRoutineSet (const GALGAS_ipic_31__38_SequentialInstructionList inObject,
                                                      GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                      C_Compiler * inCompiler
                                                      COMMA_UNUSED_LOCATION_ARGS) {
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_ipic_31__38_SequentialInstructionList temp_0 = inObject ;
  cEnumerator_ipic_31__38_SequentialInstructionList enumerator_19609 (temp_0, kEnumeration_up) ;
  while (enumerator_19609.hasCurrentObject ()) {
    callCategoryMethod_buildInstructionCalledRoutineSet ((const cPtr_ipic_31__38_SequentialInstruction *) enumerator_19609.current_mInstruction (HERE).ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (643)) ;
    enumerator_19609.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//           Category method '@ipic18Block buildCalledRoutineSet'            *
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_buildCalledRoutineSet (const GALGAS_ipic_31__38_Block inObject,
                                           GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                           C_Compiler * inCompiler
                                           COMMA_UNUSED_LOCATION_ARGS) {
  categoryMethod_buildInstructionCalledRoutineSet (inObject.mAttribute_mInstructionList, ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (652)) ;
  callCategoryMethod_buildTerminatorCalledRoutineSet ((const cPtr_ipic_31__38_AbstractBlockTerminator *) inObject.mAttribute_mTerminator.ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (653)) ;
}


//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


